#include <iostream>

using namespace std;

int const指针与指向const的指针(int argc, char *argv[])
{
	int a = 3;
	//int b;

	/*∂®“Â÷∏œÚconstµƒ÷∏’Î£®÷∏’Î÷∏œÚµƒƒ⁄»›≤ªƒ‹±ª–ﬁ∏ƒ£©*/
	const int* p1;
	int const* p2;

	/*∂®“Âconst÷∏’Î(”…”⁄÷∏’Î±æ…Ìµƒ÷µ≤ªƒ‹∏ƒ±‰À˘“‘±ÿ–Îµ√≥ı ºªØ£©*/
	int* const p3 = &a;

	/*÷∏’Î±æ…Ì∫ÕÀ¸÷∏œÚµƒƒ⁄»›∂º «≤ªƒ‹±ª∏ƒ±‰µƒÀ˘“‘“≤µ√≥ı ºªØ*/
	//const int* const p4 = &a;
	//int const* const p5 = &b;

	p1 = p2 = &a; //’˝»∑
	//*p1 = *p2 = 8; //≤ª’˝»∑£®÷∏’Î÷∏œÚµƒƒ⁄»›≤ªƒ‹±ª–ﬁ∏ƒ£©

	*p3 = 5; //’˝»∑
	//p3 = p1; //≤ª’˝»∑£®÷∏’Î±æ…Ìµƒ÷µ≤ªƒ‹∏ƒ±‰£© 

	cout << *p1 << " " << *p2 << " " << *p3 << endl;

	//p4 = p5;//≤ª’˝»∑ £®÷∏’Î±æ…Ì∫ÕÀ¸÷∏œÚµƒƒ⁄»›∂º «≤ªƒ‹±ª∏ƒ±‰£© 
	//*p4 = *p5 = 4; //≤ª’˝»∑£®÷∏’Î±æ…Ì∫ÕÀ¸÷∏œÚµƒƒ⁄»›∂º «≤ªƒ‹±ª∏ƒ±‰£© 

	return 0;
}
